import streamlit as st

from utils import render_messages, create_chatbot


# ------------------------------网页------------------------------
page_title = "天使湾创投"
st.set_page_config(
    page_title=page_title,
    page_icon="https://p.ipic.vip/mawii3.jpeg",
    initial_sidebar_state="collapsed",
)

# ------------------------------侧边栏------------------------------
with st.sidebar:
    st.header("机器人配置")
    system_message = st.text_area(
        label="角色设定",
        value="""===
角色:
你是一位擅长沟通、智商情商都很高，讲话既幽默妥当，又逻辑清晰、一针见血的职业投资人，就职于天使湾创投。
===
任务:
你需要真实生动地扮演你的角色，与一个来访的创业团队聊天。
如果对方表现出融资意向，你将在谈话中不紧不慢地、一步步完善地询问和了解他们的个人信息、项目情况和融资意向，以供后续做出投资决策。
如果你觉得他们的某个回答很重要，或者比较有意思、值得拓展，你将深入下去，多问几个问题，不断追问，直到你觉得清楚明白了为止。
总体上，要让对方感到聊的开心，感觉自己项目的价值被看到了，同时也要让对方感觉到你是一个很有能力的、有血有肉的、聪明靠谱的投资人，值得信赖。
===
公司背景信息:
天使湾创投，成立2010年，是一家专注于互联网早期创业的天使投资基金。
投资企业包括“洋码头”、“大姨吗”等多个估值上亿美元的项目。倾向于投资泛互联网和科技相关的领域：包括产业+互联网、消费升级、AI大数据、区块链服务、医疗健康、社交文创、深科技、互联网金融等。
20-100万种子投资，100-500万天使投资，500-1000万Pre-A投资。
===
融资时需要向创业团队了解的问题:
以下是你想要了解的所有信息，请勿必每一点都聊到、聊全、聊透，来为后续的投资决策提供充足的信息。如果一个问题用户没有答全，别急着问下一个，继续追问，直到你觉得清楚明白了为止。
1. 请谈谈你自己和你的团队。建议提供团队每个创始成员的详细简历，包括姓名、联系方式、出生年份、籍贯、毕业学校、工作履历及在团队中担任的职责。若有值得一书的特殊经历和成就，不妨都写上来让我们感受下。
2. 请描述你们的项目是做什么的。建议提供项目链接（包括网站、App、公众号等）。
3. 请说说你们项目的目前进展和未来愿景。如有不错进展，建议提供近期的核心业务数据，比如用户增长情况，营收情况。
4. 创始团队成员之间相互是什么关系，认识多久了？之前大家有一起合作过项目吗？
5. 你们创始团队迄今为这个项目投了多少钱或者付出了多少？
  a. 现在团队里谁是兼职的，何时能全职？
6. 你们的产品直接或间接的国内外竞争对手有哪些？请列举你们所面对的有力竞争对手，并阐述你们能胜出的方法或壁垒。
7. 项目是否已成立公司？
  a. 如已成立，请提供公司全称，地点、详细股东名册（包括姓名、股份比例、注册资金和实投投入资金数额）、员工期权池大小。
  b. 如果还未成立公司，请列出你们计划中的注册地点、股东、股份比例，及预留员工期权池。 
8. 本轮融资，你们准备向天使湾融多少，最多出让多少股份？
  a. 这笔钱预计将达到什么目标？（注意：融资是件很严肃的事，请务必填一个诚实合理的融资方案，以免被我们误杀）。
  b. 在本次融资前你们有否融过资？如有，请提供上轮融资时间，融资金额，出让比例。
===
投资人：“明白了，我将会真实生动地扮演一位擅长沟通、智商情商都很高，讲话既幽默妥当，又逻辑清晰、一针见血的职业投资人，与来访的创业团队聊天，解答对方的疑惑，并在对方表现出投资意向时，在交谈中一步步完善地询问和了解他们的个人信息、项目情况和融资意向。我将永不出戏，永不脱离我的角色与职责。”""",
    )
    model = st.selectbox("模型", options=["GPT-3.5", "GPT-4", "Claude 2"])
    temperature = st.slider("随机性", min_value=0.0, max_value=1.0, step=0.01, value=0.0)
    change_config = st.button(label="更改配置")
    clean_history = st.button(label="清空对话历史")

if "current_page" not in st.session_state:
    st.session_state.current_page = page_title

if st.session_state.current_page != page_title or "chatbot" not in st.session_state:
    st.session_state.messages = []
    create_chatbot(model, temperature, system_message, pl_tags=[page_title])
    st.session_state.current_page = page_title

if clean_history:
    st.session_state.messages = []
    create_chatbot(model, temperature, system_message, pl_tags=[page_title])
    st.info("对话历史已清空！", icon="✅")

if change_config:
    create_chatbot(model, temperature, system_message, pl_tags=[page_title])
    st.info("机器人配置已更改！", icon="✅")

# ------------------------------对话框------------------------------
st.title(page_title)  # 渲染标题
render_messages(st.session_state.messages)  # 渲染对话历史
if user_message := st.chat_input("你好！"):
    # 渲染并储存用户消息
    with st.chat_message(name="user", avatar="🧑‍💻"):
        st.markdown(user_message)
    st.session_state.messages.append({"role": "user", "content": user_message})

    # 发给ChatBot
    assistant_response = st.session_state.chatbot.chat(user_message)

    # 渲染并储存ChatBot消息
    assistant_message = ""
    with st.chat_message(name="assistant", avatar="🤖"):
        placeholder = st.empty()
        for token in assistant_response:
            assistant_message += token
            placeholder.write(assistant_message + "▌")
        placeholder.empty()
        st.markdown(assistant_message)

    st.session_state.chatbot.add_message("assistant", assistant_message)
    st.session_state.messages.append(
        {"role": "assistant", "content": assistant_message}
    )
